#!/usr/bin/env python3
import json
import re


def add_soon_flag(cards):
    target = [
      "【D.C.4コラボ】有里咲",
      "【夢見るバニータイム】ひまり子",
      "【とろけるバスタイム】ひまり子",
      "【夢見るバニータイム】スカーレット",
      "【夢見るバニータイム】凪",
      "【夢見るバニータイム】紬",
      "【夢見るバニータイム】彩葉",
      "【白衣の天使と白昼夢】花音",
      "【白衣の天使と白昼夢】凪",
      "【お家神社で新春初詣】紬",
      "【白衣の天使と白昼夢】紬",
      "【二人きりのささやき耳かき】紬",
      "【モフモフさん、いらっしゃい！】彩葉",
      "【恐怖のHorrorween Party】彩葉",
      "【チョコパラダイス】彩葉",
      "【満開！夜桜大宴会】花音",
      "【OFFの顔】彩葉",
      "【春の駅弁祭り】彩葉",
      "【満開！夜桜大宴会】紬",
      "【夢見るバニータイム】花音",
      "【二人きりのささやき耳かき】スカーレット",
    ]
    for x in cards:
        x["soon_flag"] = x["name"] in target
